#include <stdio.h>
#include <stdlib.h>
//定义邻接矩阵（储存边信息）
int e[13][13] = {
    {0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 0},
    {0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 1, 0},
    {0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0},
    {1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0},
    {1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 1, 0},
    {1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0},
    {1, 1, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0},
    {1, 1, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0},
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0}};
//定义起始颜色数组（存储顶点信息）
int v[13] = {-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1};
//涂色函数

void streetlamp()
{
int cnt_color = 1;
int i, j;
    for (i = 0; i < 13; ++i) //一层循环，找到未涂色的点
    {
        int flag = 1;
        if (v[i] == -1)
        {
            v[i] = cnt_color;
            printf("第%d种颜色节点：%d ", cnt_color, i);
            for (j = 1; j < 13; ++j) //二层循环，找到未涂色且与i不冲突的顶点
            {
                if (v[j] == -1 && e[i][j] == 0)
                {
                    for (int h = 0; h < 13; ++h) //三层循环，确定j与其他同色的点不冲突
                        if (v[h] == cnt_color && e[j][h] == 1)
                        {
                            flag = 0;
                            break;
                        }
                    if (flag == 1)
                    {
                        v[j] = cnt_color;
                        printf("%d ", j);
                    }
                }
            }
            cnt_color++;
            printf("\n");
        }
    }
    printf("总共%d种颜色\n", cnt_color - 1);
}
int main()
{
int x;
while (1)
 {
printf("-------------操作选项-----------\n");
printf("1:返回菜单 \n");
printf("2:退出程序 \n");
printf("3:输出涂色方案 \n");
printf("--------------------------------\n");
printf("按数字键选择要执行的操作: ");
scanf("%d",&x);  printf("\n");  //输入2跳出循环，退出程序
 if(x==2)   break;
switch(x)
{
case 1:  break; //输入1，跳出switch语句，进入下一次循环
case 3:  streetlamp();
break;
 default:  //数字输入错误，跳出siwtch语句，进入下一次循环
printf("输入的数字不正确\n");   break;
 }
}
return 0;
}

